In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:koushik16@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[('de_project',),
 ('dt_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('uber',),
 ('world',),
 ('zomato',)]

In [9]:
%%sql
use sys;
###RANK and DENSE RANK
CREATE TABLE Students (
    StudentID INT,
    StudentName VARCHAR(100),
    ExamScore INT
);

INSERT INTO Students (StudentID, StudentName, ExamScore)
VALUES
    (1, 'Alice', 95),
    (2, 'Bob', 90),
    (3, 'Charlie', 95),
    (4, 'David', 85),
    (5, 'Eva', 90);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [10]:
%%sql
select * from Students

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Alice', 95),
 (2, 'Bob', 90),
 (3, 'Charlie', 95),
 (4, 'David', 85),
 (5, 'Eva', 90)]

In [13]:
%%sql
###RANK
select StudentID,StudentName,ExamScore,
rank() over (order by ExamScore desc) as Student_Rank
from Students;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Alice', 95, 1),
 (3, 'Charlie', 95, 1),
 (2, 'Bob', 90, 3),
 (5, 'Eva', 90, 3),
 (4, 'David', 85, 5)]

In [14]:
%%sql
###DENSE_RANK
select StudentID,StudentName,ExamScore,
dense_rank() over (order by ExamScore desc) as Student_Rank
from Students;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Alice', 95, 1),
 (3, 'Charlie', 95, 1),
 (2, 'Bob', 90, 2),
 (5, 'Eva', 90, 2),
 (4, 'David', 85, 3)]

In [15]:
%%sql
##PERCENT_RANK
CREATE TABLE ProductSales (
    ProductID INT,
    ProductName VARCHAR(100),
    SalesAmount INT
);


INSERT INTO ProductSales (ProductID, ProductName, SalesAmount) VALUES
(1, 'Product 1', 500),
(2, 'Product 2', 600),
(3, 'Product 3', 550),
(4, 'Product 4', 700),
(5, 'Product 5', 750),
(6, 'Product 6', 800),
(7, 'Product 7', 850),
(8, 'Product 8', 900),
(9, 'Product 9', 950),
(10, 'Product 10', 1000),
(11, 'Product 11', 600),
(12, 'Product 12', 650),
(13, 'Product 13', 700),
(14, 'Product 14', 750),
(15, 'Product 15', 800),
(16, 'Product 16', 850),
(17, 'Product 17', 900),
(18, 'Product 18', 950),
(19, 'Product 19', 1000),
(20, 'Product 20', 100),
(21, 'Product 21', 200),
(22, 'Product 22', 250),
(23, 'Product 23', 300),
(24, 'Product 24', 350),
(25, 'Product 25', 400),
(26, 'Product 26', 450),
(27, 'Product 27', 500),
(28, 'Product 28', 550),
(29, 'Product 29', 600),
(30, 'Product 30', 650),
(31, 'Product 31', 700),
(32, 'Product 32', 750),
(33, 'Product 33', 800),
(34, 'Product 34', 850),
(35, 'Product 35', 900),
(36, 'Product 36', 950),
(37, 'Product 37', 1000),
(38, 'Product 38', 550),
(39, 'Product 39', 600),
(40, 'Product 40', 650),
(41, 'Product 41', 700),
(42, 'Product 42', 750),
(43, 'Product 43', 800),
(44, 'Product 44', 850),
(45, 'Product 45', 900),
(46, 'Product 46', 950),
(47, 'Product 47', 1000),
(48, 'Product 48', 550),
(49, 'Product 49', 600),
(50, 'Product 50', 650);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
50 rows affected.

[]

In [16]:
%%sql
select ProductID, ProductName, SalesAmount,
percent_rank() over (order by SalesAmount) as percent_product from ProductSales;

 * mysql+mysqlconnector://root:***@localhost/
50 rows affected.

[(20, 'Product 20', 100, 0.0),
 (21, 'Product 21', 200, 0.02040816326530612),
 (22, 'Product 22', 250, 0.04081632653061224),
 (23, 'Product 23', 300, 0.061224489795918366),
 (24, 'Product 24', 350, 0.08163265306122448),
 (25, 'Product 25', 400, 0.10204081632653061),
 (26, 'Product 26', 450, 0.12244897959183673),
 (1, 'Product 1', 500, 0.14285714285714285),
 (27, 'Product 27', 500, 0.14285714285714285),
 (3, 'Product 3', 550, 0.1836734693877551),
 (48, 'Product 48', 550, 0.1836734693877551),
 (38, 'Product 38', 550, 0.1836734693877551),
 (28, 'Product 28', 550, 0.1836734693877551),
 (2, 'Product 2', 600, 0.2653061224489796),
 (11, 'Product 11', 600, 0.2653061224489796),
 (49, 'Product 49', 600, 0.2653061224489796),
 (39, 'Product 39', 600, 0.2653061224489796),
 (29, 'Product 29', 600, 0.2653061224489796),
 (30, 'Product 30', 650, 0.3673469387755102),
 (40, 'Product 40', 650, 0.3673469387755102),
 (12, 'Product 12', 650, 0.3673469387755102),
 (50, 'Product 50', 650, 0.3673469387755102),
 (4, 'Product 4', 700, 0.4489795918367347),
 (31, 'Product 31', 700, 0.4489795918367347),
 (41, 'Product 41', 700, 0.4489795918367347),
 (13, 'Product 13', 700, 0.4489795918367347),
 (5, 'Product 5', 750, 0.5306122448979592),
 (32, 'Product 32', 750, 0.5306122448979592),
 (42, 'Product 42', 750, 0.5306122448979592),
 (14, 'Product 14', 750, 0.5306122448979592),
 (6, 'Product 6', 800, 0.6122448979591837),
 (33, 'Product 33', 800, 0.6122448979591837),
 (15, 'Product 15', 800, 0.6122448979591837),
 (43, 'Product 43', 800, 0.6122448979591837),
 (34, 'Product 34', 850, 0.6938775510204082),
 (16, 'Product 16', 850, 0.6938775510204082),
 (7, 'Product 7', 850, 0.6938775510204082),
 (44, 'Product 44', 850, 0.6938775510204082),
 (8, 'Product 8', 900, 0.7755102040816326),
 (17, 'Product 17', 900, 0.7755102040816326),
 (35, 'Product 35', 900, 0.7755102040816326),
 (45, 'Product 45', 900, 0.7755102040816326),
 (9, 'Product 9', 950, 0.8571428571428571),
 (36, 'Product 36', 950, 0.8571428571428571),
 (18, 'Product 18', 950, 0.8571428571428571),
 (46, 'Product 46', 950, 0.8571428571428571),
 (10, 'Product 10', 1000, 0.9387755102040817),
 (19, 'Product 19', 1000, 0.9387755102040817),
 (37, 'Product 37', 1000, 0.9387755102040817),
 (47, 'Product 47', 1000, 0.9387755102040817)]

In [17]:
%%sql
CREATE TABLE EmployeeSales (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    SalesAmount DECIMAL(10, 2)
);


INSERT INTO EmployeeSales (EmployeeID, EmployeeName, SalesAmount) VALUES
(1, 'Alice', 10000),
(2, 'Bob', 8500),
(3, 'Charlie', 7500),
(4, 'David', 6000),
(5, 'Eva', 11000),
(6, 'Frank', 4500),
(7, 'Grace', 3000),
(8, 'Hank', 4000),
(9, 'Ivy', 8000),
(10, 'Jack', 9500);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
10 rows affected.

[]

In [18]:
%%sql
##NTILE
select EmployeeID, EmployeeName, SalesAmount,
NTILE(4) over (order by SalesAmount desc) as Performancegroup
from EmployeeSales

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(5, 'Eva', Decimal('11000.00'), 1),
 (1, 'Alice', Decimal('10000.00'), 1),
 (10, 'Jack', Decimal('9500.00'), 1),
 (2, 'Bob', Decimal('8500.00'), 2),
 (9, 'Ivy', Decimal('8000.00'), 2),
 (3, 'Charlie', Decimal('7500.00'), 2),
 (4, 'David', Decimal('6000.00'), 3),
 (6, 'Frank', Decimal('4500.00'), 3),
 (8, 'Hank', Decimal('4000.00'), 4),
 (7, 'Grace', Decimal('3000.00'), 4)]